var moment = require("moment");
var _ = require("lodash");

const eventFixtures = [
    {
      "id": "1",
      "title": "Новина №1",
      "description": "Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі. Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі.",
      "img": "/img/event-book.jpg",
      "date": "31.12.2019"
    },
    {
      "id": "2",
      "title": "Новина №2",
      "description": "Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі. Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі.",
      "img": "/img/event-grass.jpg",
      "date": "20.11.2019"
    },
    {
      "id": "3",
      "title": "Новина №3",
      "description": "Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі. Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі.",
      "img": "/img/event-book.jpg",
      "date": "11.10.2019"
    },
    {
      "id": "4",
      "title": "Новина №4",
      "description": "Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі. Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі.",
      "img": "/img/event-grass.jpg",
      "date": "31.09.2019"
    },
    {
      "id": "5",
      "title": "Новина №5",
      "description": "Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі. Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі.",
      "img": "/img/event-book.jpg",
      "date": "03.07.2019"
    },
    {
      "id": "6",
      "title": "Новина №6",
      "description": "Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі. Чотиризірковий готель Favor Park розташований у Києві, за 3,2 км від Національного комплексу “Експоцентр України”. Стійка реєстрації працює вдень і вночі.",
      "img": "/img/event-grass.jpg",
      "date": "30.05.2019"
    }
];

var events = [];

// Create the events array
for (var event of eventFixtures) {
  // Make up some dates for the events
  var date;
  if (event.date) {
    // If certain events have specific date requirements (e.g. new year's eve, Halloween)
    // use that date and add the year
    date = moment(moment().format("YYYY/") + "/" + event.date, "YYYY/MM/DD");
  } else {
    // Else randomize a date within the next 30 days
    date = moment().add(_.random(0, 30), "days");
  }

  event.date = date.format("YYYY/MM/DD");
  events.push(event);
}

module.exports = events;
